// Using DeviceProcessEvents to search for events that powershell has done in a single instance.

DeviceProcessEvents
| where ProcessCommandLine contains "powershell" 
    and ProcessCommandLine contains "netsh wlan show profiles" 
    and ProcessCommandLine contains "key=clear"
    and ProcessCommandLine contains "Key Content"
| project TimeGenerated, DeviceName, AccountName, ProcessCommandLine, InitiatingProcessCommandLine, InitiatingProcessFileName