DeviceProcessEvents
| where ProcessCommandLine contains "powershell" and ProcessCommandLine contains "wget" and ProcessCommandLine contains "python.org"
| project TimeGenerated, DeviceName, AccountName, ProcessCommandLine, InitiatingProcessCommandLine, InitiatingProcessFileName