let KnownIPs = dynamic([
    "38.180.81.153",
    "108.181.115.171",
    "38.180.195.187",
    "185.174.101.240",
    "194.36.209.227",
    "92.118.112.143",
    "185.174.101.69",
    "92.118.112.208",
    "108.181.182.143",
    "173.44.141.226",
    "162.252.173.12",
    "23.227.193.172",
    "185.33.86.15",
    "45.66.248.150",
    "5.8.63.178",
    "88.119.175.70",
    "185.219.220.175",
    "45.82.85.50",
    "104.238.61.144",
    "193.203.49.90",
    "38.146.28.93",
    "88.119.175.65",
    "37.1.212.18"
]);
DeviceNetworkEvents
| where RemoteIP has_any (KnownIPs)
| project Timestamp, DeviceName, RemoteIP
| summarize ConnectionCount = count() by RemoteIP, DeviceName