let KnownIPs = dynamic([
    "207.174.31.215",
    "185.72.8.129",
    "38.180.137.245",
    "38.180.137.141",
    "45.76.228.18",
    "140.82.4.20",
    "149.28.125.75",
    "172.96.15.104",
    "193.124.24.117",
    "207.90.236.231",
    "155.138.226.179",
    "172.96.15.103",
    "85.209.85.206",
    "207.174.31.92",
    "166.88.182.126",
    "23.146.184.221",
    "194.135.104.251",
    "23.133.88.96",
    "166.1.173.65",
    "38.180.244.209",
    "91.149.239.242",
    "155.138.211.27",
    "128.254.146.183",
    "166.88.182.65",
    "85.209.85.199",
    "82.153.134.38",
    "194.135.104.175",
    "5.61.39.26"
]);
DeviceNetworkEvents
| where RemoteIP has_any (KnownIPs)
| project Timestamp, DeviceName, RemoteIP
| summarize ConnectionCount = count() by RemoteIP, DeviceName