DeviceNetworkEvents
| where RemoteIP == "5.61.39.26" or RemoteUrl contains "5.61.39.26"
| project Timestamp, DeviceName, LocalIP, RemoteIP, RemotePort, InitiatingProcessFileName, InitiatingProcessCommandLine